############################################################################################################# 
# 设置全局参数, 根据情况修改
#############################################################################################################
dir = "GSE132465(韩国)" # 工作路径下存储数据的文件夹

############################################################################################################# 
# 准备环境
#############################################################################################################
def prepare_environment(wd, dir):
    %load_ext autotime
    import os
    import pandas as pd
    import scanpy as sc

    os.chdir(wd)
    os.makedirs(f"{dir}/h5ad", exist_ok=True)
prepare_environment(wd="/home/students/zhangtao/research/singlecell/database", dir=dir)

############################################################################################################# 
# 将数据读取进来，然后转化为adata格式，将基因去重，后将文件写出为adata_1
#############################################################################################################
counts = pd.read_csv("GSE132465(韩国)/GSE132465_GEO_processed_CRC_10X_raw_UMI_count_matrix.txt.gz", index_col=0, sep="\t").T
adata=sc.AnnData(counts)
adata.var_names_make_unique()
adata.write_h5ad("GSE132465(韩国)/h5ad/GSE132465(韩国)_1.h5ad")
